#include <iostream>
using namespace std;

void bubbleSort(int arr[], int n){
    for(int i = 0; i < n - 1; i++){ //* รอบที่ n-1 เพราะ รอบสุดท้ายจะเรียงเสร็จเอง
        bool swapped = false; //* เช็คว่ารอบนี้มีการสลับไหม
        for(int j = 0; j < n - i - 1; j++){ //* n-i-1 เพราะ ตัวสุดท้ายของรอบก่อนหน้าเรียงเสร็จแล้ว
            if (arr[j] > arr[j + 1]){ //* ถ้าปรับเป็น arr[j] < arr[j + 1] จะเป็นการเรียงจากมากไปน้อย
                int temp = arr[j];
                arr[j] = arr[j + 1];
                arr[j + 1] = temp;
                swapped = true;
            }
        }
        if(!swapped) break; //! ถ้าไม่มีการสลับเลย แสดงว่าเรียงเสร็จแล้ว
    }
}

int main(){
    int arr[] = {5, 1, 4, 2};
    int n = sizeof(arr) / sizeof(arr[0]);
    bubbleSort(arr, n);
    for(int x : arr)
        cout<<x<<" ";
}

/*
- Bubble Sort คืออัลกอริทึมเรียงลำดับที่เปรียบเทียบตัวเลขที่อยู่ติดกันทีละคู่ แล้วสลับถ้าลำดับผิด
- เปรียบเหมือน ฟองอากาศลอยขึ้นบนผิวน้ำ
    ● ค่าที่ “ใหญ่” จะค่อย ๆ ลอยไปอยู่ด้านหลัง
    ● ค่าที่ “เล็ก” จะถูกดันมาด้านหน้า
@ แนวคิดหลัก
1. เดินดูข้อมูลจากซ้ายไปขวา
2. เปรียบเทียบ arr[j] กับ arr[j+1]
3. ถ้า arr[j] > arr[j+1] → สลับตำแหน่ง
4. ทำซ้ำหลายรอบ จนข้อมูลเรียงหมด
@ ประสิทธิภาพ (Time Complexity)
- จำนวนรอบประมาณ (n - 1) + (n - 2) + ... + 1
* 1. กรณีดีที่สุด (Best Case): O(n^2) - ข้อมูลเรียงอยู่แล้ว เช่น [1, 2, 3, 4, 5]
     - สามารถเป็น O(n) ได้ถ้าใช้ flag ตรวจสอบการ swap
* 2. กรณีทั่วไป (Average Case): O(n^2) – ข้อมูลสุ่มทั่วไป เช่น [3, 4, 5, 2, 1]
* 3. กรณีแย่ที่สุด (Worst Case): O(n^2) – ข้อมูลเรียงกลับด้าน เช่น [5, 4, 3, 2, 1]
@ ตัวอย่างการทำงานตามโค้ด
arr = [5, 1, 4, 2]  
* รอบที่ 1 → [5, 1, 4, 2]
    ✅ (5,1) → สลับ → [1,5,4,2]
    ✅ (5,4) → สลับ → [1,4,5,2]
    ✅ (5,2) → สลับ → [1,4,2,5]
    ● ตัวใหญ่สุด 5 ไปอยู่ท้ายแล้ว
* รอบที่ 2 → [1,4,2,5]
    ❌ (1,4) → ไม่สลับ
    ✅ (4,2) → สลับ → [1,2,4,5]
    ● ตัวรองใหญ่สุด 4 อยู่ถูกที่
* รอบที่ 3
    ❌ (1,2) → ไม่สลับ
- arr = [1, 2, 4, 5]
*/