#include <bits/stdc++.h>
using namespace std;

vector<int> value = {1, 4, 5, 7};
vector<int> weight = {1, 3, 4, 5};
int knapsack(int i, int w, vector<vector<int>>& memo){
    //@ Base Case: ถ้าไม่มีของให้เลือก (i=0) หรือกระเป๋าเต็มแล้ว (w=0)
    if(i == 0 || w == 0)
        return 0;
    //@ ถ้าเคยคำนวณแล้ว (อยู่ใน memo) ให้คืนค่าจากตาราง memo ทันที ไม่ต้องทำ Recursion ซ้ำ
    if(memo[i][w] != -1)
        return memo[i][w];
    //@ ตรวจสอบว่า "ของชิ้นปัจจุบัน" (ดัชนี i-1) น้ำหนักเกินความจุที่เหลือ (w) หรือไม่
    if(weight[i - 1] <= w){
        //* ทางเลือกที่ 1: เลือกใส่ของชิ้นนี้
        // มูลค่าจะเท่ากับ value[i-1] + ผลลัพธ์ที่ดีที่สุดของของที่เหลือ (i-1) โดยหักน้ำหนักออก
        int include = value[i - 1] + knapsack(i - 1, w - weight[i - 1], memo);
        //* ทางเลือกที่ 2: ไม่เลือกของชิ้นนี้
        // มูลค่าจะเท่ากับผลลัพธ์ที่ดีที่สุดของของที่เหลือ (i-1) โดยน้ำหนักที่เหลือเท่าเดิม
        int exclude = knapsack(i - 1, w, memo);
        //* เลือกค่าที่มากที่สุด (max) ระหว่างการ "ใส่" หรือ "ไม่ใส่" แล้วบันทึกลง memo
        memo[i][w] = max(include, exclude);
    }
    else
        //* กรณีของหนักเกิน: ใส่ไม่ได้แน่นอน ต้อง "ไม่เลือก" (Exclude) เพียงอย่างเดียว
        memo[i][w] = knapsack(i - 1, w, memo);
    return memo[i][w];
}

int main(){
    int n = value.size();
    int maxWeight = 7;
    vector<vector<int>> memo(n + 1, vector<int>(maxWeight + 1, -1));
    int result = knapsack(n, maxWeight, memo);
    cout<<result<<endl;
    return 0;
}

/*
@ 0/1 Knapsack Problem (ปัญหาการจัดของลงกระเป๋า)
- เรามีสิ่งของอยู่ชุดหนึ่ง แต่ละชิ้นมี "น้ำหนัก (weight)" และ "มูลค่า (value)" และมีกระเป๋าที่รับน้ำหนักได้จำกัด
  (maxWeight) ถามว่า "เราควรเลือกหยิบของชิ้นไหนใส่กระเป๋าบ้าง เพื่อให้ได้มูลค่ารวมมากที่สุด โดยที่น้ำหนักต้อง
  ไม่เกินกระเป๋า?"
@ หลักการ (Include / Exclude)
- สมมติเราพิจารณาสิ่งของชิ้นหนึ่ง (ชิ้นที่ i) เพื่อนำไปใส่กระเป๋าที่เหลือน้ำหนัก w เรามีทางเลือก 2 ทาง:
    ● ไม่เอาของชิ้นที่ i (Exclude): เราจะไม่ได้มูลค่าเพิ่ม แต่น้ำหนักกระเป๋าก็ยังเหลือ w เท่าเดิม (ไปลุ้นเอากำ
      ไรจากของชิ้นอื่นที่เหลือแทน)
    ● เอาของชิ้นที่ i (Include): เราจะได้มูลค่าของชิ้นนี้มาบวกเพิ่ม แต่ต้องหักน้ำหนักของชิ้นนี้ออกจากพื้นที่
      กระเป๋า (w - weight[i])
- dp[i][w] คือ มีของให้พิจารณา i ชิ้น และกระเป๋ารับน้ำหนักได้สูงสุด w จะได้มูลค่าที่สูงที่สุดเท่าไหร่
- เนื่องจากเราต้องการกำไรสูงสุด เราจะนำผลลัพธ์ของทั้ง 2 ทางเลือกมาเปรียบเทียบกัน แล้วเลือกทางที่ทำให้ผลรวม
  เป็น "มูลค่าที่มากที่สุด (max)"
* Basecase:
    ● dp[i][0] = 0 : กระเป๋ารับน้ำหนักได้ 0 (เต็มแล้ว) จะมีของให้พิจารณากี่ชิ้นก็ใส่ไม่ได้ มูลค่าจึงเป็น 0
    ● dp[0][w] = 0 : ไม่มีของให้เลือกเลย (0 ชิ้น) ถึงกระเป๋าจะว่างแค่ไหน ก็ไม่ได้มูลค่าเลย เป็น 0
*/