#include <bits/stdc++.h>

using namespace std;

bool isSubsetSum(const vector<int>& arr, int target) {
    int n = arr.size();
    //* สร้างตาราง DP ขนาด (n+1) x (target+1) กำหนดค่าเริ่มต้นเป็น false
    vector<vector<bool>> dp(n + 1, vector<bool>(target + 1, false));
    //@ Base Case 1: มีเลข 0 ตัว ผลรวมเท่ากับ j เป็น fasle (เป็นไปไม่ได้)
    //@ Base Case 2: มีเลข i คัว แต่ไม่เลือกทุกตัว ผลรวมจึงเท่ากับ 0 เป็น true
    for(int i = 0; i <= n; i++) 
        dp[i][0] = true;
    //* เริ่มคำนวณ DP จากล่างขึ้นบน
    for(int i = 1; i <= n; i++) {
        for(int j = 1; j <= target; j++) {
            //* กรณีที่ 1: ตัวเลขปัจจุบัน (arr[i-1]) มีค่า "มากกว่า" เป้าหมาย (j)
            // เราเลือกเลขตัวนี้ไม่ได้เด็ดขาด จึงต้องดึงคำตอบจากการ "ไม่เลือก" (ดึงค่าจากแถวบน)
            // เพราะแถวด้านบนอาจสามารถทำผมรวมได้เท่ากับ j
            if(arr[i - 1] > j) 
                dp[i][j] = dp[i - 1][j];
            //* กรณีที่ 2: ตัวเลขปัจจุบันมีค่าน้อยกว่าหรือเท่ากับเป้าหมาย
            // คำตอบจะมาจาก: "ไม่เลือก" (dp[i-1][j]) หรือ "เลือก" (dp[i-1][j - arr[i-1]])
            else
                dp[i][j] = dp[i - 1][j] || dp[i - 1][j - arr[i - 1]];
        }
    }
    return dp[n][target];
}

int main() {
    vector<int> arr = {3, 4, 5, 2};
    int target = 9;
    if(isSubsetSum(arr, target))
        cout<<"Found a subset with given sum" << endl;
    else 
        cout<<"No subset with given sum" << endl;
    return 0;
}

/*
@ Subset Sum Problem
- เรามีอาร์เรย์ของตัวเลขอยู่ชุดหนึ่ง และมีตัวเลขเป้าหมาย (target) ถามว่า "มีตัวเลขบางตัวในอาร์เรย์นี้ ที่บวกกัน
  แล้วได้เท่ากับ target พอดีเป๊ะหรือไม่?"
@ หลักการ (Include / Exclude)
- สมมติเราพิจารณาตัวเลขตัวหนึ่งในเซต (เช่น เลข x) เพื่อให้ได้ผลรวมเป้าหมาย (เช่น Target) เรามี
  ทางเลือก 2 ทาง:
    ● ไม่เอาเลข x (Exclude): เราต้องไปลุ้นว่าตัวเลขที่เหลือตัวอื่นๆ จะบวกกันให้ได้ Target เท่าเดิมได้ไหม
    ● เอาเลข x (Include): เราต้องไปลุ้นว่าตัวเลขที่เหลือตัวอื่นๆ จะบวกกันให้ได้ค่า Target - x ได้ไหม 
      (เพราะเรามี x อยู่ในมือแล้ว)
- dp[i][j] คือ มีเลขทั้งหมด i ตัว สร้างผลรวม j ได้
- ถ้าทางเลือกใดทางเลือกหนึ่งทำให้ผลรวมเป็น target ได้ (เป็น true) คำตอบของข้อนี้ก็คือ true
* Basecase:
    ● dp[i][0] = true : มีเลข i คัว แต่ไม่เลือกทุกตัว ผลรวมจึงเท่ากับ 0
    ● dp[0][j] = false : มีเลข 0 ตัว สร้างผลรวมได้ j (เป็นไปไม่ได้)
@ โค้ด C++ : Subset Sum (Bottom-Up 2D Table)
- วิธีสร้างตาราง (Tabulation) เป็นวิธีที่เข้าใจง่ายและเห็นภาพชัดเจนที่สุด เราจะสร้างตาราง 2 มิติ dp[i][j]
    ● แถว (Rows): แทนตัวเลขในเซตที่เรามี (ตั้งแต่ตัวที่ 0 ถึง n)
    ● คอลัมน์ (Columns): แทนผลรวมที่เป็นไปได้ (ตั้งแต่ 0 ถึง Target)
    ● ค่าในช่อง dp[i][j]: จะเป็น True หรือ False (บอกว่าใช้เลข i ตัวแรก สร้างผลรวม j ได้หรือไม่)
@ ตัวอย่าง Subset Sum 
* arr = {3 4 5 2}, target = 9
              0  1  2  3  4  5  6  7  8  9
{}         |  1  0  0  0  0  0  0  0  0  0 
{3}        |  1  0  0  1  0  0  0  0  0  0 
{3 4}      |  1  0  0  1  1  0  0  1  0  0 
{3 4 5}    |  1  0  0  1  1  1  0  1  1  1 
{3 4 5 2}  |  1  0  1  1  1  1  1  1  1  1 
* ผลลัพธ์ true: เนื่องจาก 4 + 5 = 9
*/