#include <bits/stdc++.h>
using namespace std;

int main() {
    int n;
    cin>>n; //* รับจำนวนไฟล์
    vector<int> filesLength(n);
    //* รับความยาวของแต่ละไฟล์
    for(int i = 0; i < n; i++)
        cin>>filesLength[i];
    //@ 1. เรียงลำดับไฟล์จากขนาด "เล็กไปใหญ่" เสมอ
    for(int i = 0; i < n - 1; i++){
        for(int j = 0; j < n - i - 1; j++){
            if(filesLength[j] > filesLength[j + 1])
                swap(filesLength[j], filesLength[j+1]);
        }
    }
    double totalRetrievalTime = 0.0; //* เก็บผลรวมเวลาทั้งหมด
    double currentTime = 0.0; //* เก็บเวลาที่ใช้สะสม ณ ตำแหน่งปัจจุบัน
    //@ 2. คำนวณเวลาการเข้าถึงไฟล์
    for(int i = 0; i < n; i++){
        //* เวลาในการเข้าถึงไฟล์นี้ = เวลาสะสมก่อนหน้า + ความยาวไฟล์นี้
        currentTime += filesLength[i]; 
        //* เอาเวลาการเข้าถึงของไฟล์นี้ไปบวกเข้ากับเวลาเข้าถึงไฟล์ก่อนหน้านี้ทั้งหมด 
        totalRetrievalTime += currentTime; 
    }
    //@ 3. หาค่าเฉลี่ย (เวลารวมทั้งหมด / จำนวนไฟล์)
    double meanTime = totalRetrievalTime / n;
    cout<<fixed<<setprecision(2); //* พิมพ์ผลลัพธ์เป็นทศนิยม 2 ตำแหน่ง
    cout<<meanTime<<endl;
    return 0;
}

/*
* Test Case1
    Input:  6
            7 8 15 6 12 9
    Output: 28.17
? Optimal Storage on Tapes
@ หลักการคิด (Greedy Strategy)
- โจทย์ต้องการหา "เวลารวมเฉลี่ยที่น้อยที่สุด (Minimum Mean Retrieval Time)" ในการอ่านไฟล์จากเทป 
  เราต้องเริ่มอ่านจากจุดเริ่มต้นเสมอ หมายความว่า:
    ● ไฟล์ที่เก็บไว้เป็นอันดับแรก จะถูกอ่านแค่ความยาวของตัวมันเอง
    ● ไฟล์ที่เก็บไว้เป็นอันดับที่สอง ต้องเสียเวลาอ่านผ่านไฟล์แรกก่อน แล้วค่อยอ่านตัวมันเอง
    ● ไฟล์ที่เก็บไว้ท้ายๆ จะต้องรอให้อ่านผ่านไฟล์ทั้งหมดที่อยู่ข้างหน้ามันก่อน
- ดังนั้น วิธีที่คุ้มค่าที่สุด (Greedy Choice) คือ: "เอาไฟล์ที่ขนาดเล็กที่สุด (สั้นที่สุด) ไว้หน้าสุดเสมอ" 
  เพื่อให้ไฟล์อื่นๆ ที่ตามมาข้างหลังไม่ต้องเสียเวลารออ่านไฟล์ขยะที่ยาวเกินความจำเป็น
@ ตัวอย่าง
- ให้ n = 6, ไฟล์: 7 8 15 6 12 9
1. เรียงลำดับ (Sort): 6, 7, 8, 9, 12, 15
2. คำนวณเวลาสะสม:
    ● ไฟล์ที่ 1 (ขนาด 6) ใช้เวลา = 6
    ● ไฟล์ที่ 2 (ขนาด 7) ใช้เวลา = 6 + 7 = 13
    ● ไฟล์ที่ 3 (ขนาด 8) ใช้เวลา = 13 + 8 = 21
    ● ไฟล์ที่ 4 (ขนาด 9) ใช้เวลา = 21 + 9 = 30
    ● ไฟล์ที่ 5 (ขนาด 12) ใช้เวลา = 30 + 12 = 42
    ● ไฟล์ที่ 6 (ขนาด 15) ใช้เวลา = 42 + 15 = 57
3. หาผลรวมทั้งหมด: 6 + 13 + 21 + 30 + 42 + 57 = 169
4. หาค่าเฉลี่ย: 169 / 6 = 28.1666...
5. ปัดทศนิยม 2 ตำแหน่ง: แสดงผลเป็น 28.17
*/