#include <iostream>
using namespace std;

//? ฟังก์ชันแบ่งส่วน (Partition) → จัด pivot ให้อยู่ตำแหน่งที่ถูกต้อง, และคืน index ของ pivot กลับมา
int partition(int arr[], int low, int high){ 
    int pivot = arr[high]; //! pivot คือค่าที่ใช้แบ่งซ้าย–ขวา กำหนดให้ตัวสุดท้ายเป็น pivot
    int i = low - 1; //* ทำหน้าที่ชี้ตำแหน่งสุดท้ายของฝั่งที่ เล็กกว่า pivot
    for (int j = low; j < high; j++){
        if (arr[j] < pivot){
            i++;
            swap(arr[i], arr[j]); //* เมื่อเจอค่าที่ < pivot → ขยับ i แล้วสลับค่า
        }
    }
    swap(arr[i + 1], arr[high]); //* วาง pivot ที่ตำแหน่งถูกต้อง 
    return i + 1; //* คืนค่า pivot index 
}

//? ฟังก์ชัน Quick Sort
void quickSort(int arr[], int low, int high){
    if (low < high){
        int pi = partition(arr, low, high); //* pi = pivot index
        quickSort(arr, low, pi - 1);   //* arr ฝั่งซ้าย ที่สมาชิกมีค่า < pivot
        quickSort(arr, pi + 1, high);  //* arr ฝั่งขวา ที่สมาชิกมีค่า > pivot
    }
}

int main(){
    int arr[] = {8, 3, 1, 7, 0, 10, 2};
    //* sizeof คือ operator ที่ใช้บอกขนาดหน่วยความจำ (เป็น byte) ของตัวแปรหรือชนิดข้อมูล

    int n = sizeof(arr) / sizeof(arr[0]); //* จำนวนสมาชิก = (ขนาดทั้งอาร์เรย์) / (ขนาดของสมาชิก 1 ตัว)
    quickSort(arr, 0, n - 1);
    cout << "Sorted array: ";
    for (int i = 0; i < n; i++)
        cout << arr[i] << " ";
    return 0;
}

/*
- Quick Sort คืออัลกอริทึมการเรียงลำดับที่เร็วและนิยมใช้มากที่สุดตัวหนึ่ง โดยใช้หลักการ "Divide and Conquer"
  (แบ่งแยกและเอาชนะ)
@ แนวคิดหลักของ Quick Sort (คิดแบบคลาสสิก)
- Quick Sort ใช้แนวคิด Divide and Conquer (แบ่งแล้วพิชิต)
* 1. เลือกตัวหนึ่งเป็น Pivot
* 2. จัดเรียงให้
     ● ค่าที่ น้อยกว่า Pivot ไปอยู่ซ้าย
     ● ค่าที่ มากกว่า Pivot ไปอยู่ขวา
* 3. ทำแบบเดิมซ้ำ(Recursive) กับฝั่งซ้าย และฝั่งขวาหยุดเมื่อเหลือข้อมูล 0 หรือ 1 ตัว (เรียงอยู่แล้ว)
- จุดเด่นคือ ไม่ต้องใช้หน่วยความจำเพิ่มเยอะ และโดยเฉลี่ยเร็วมาก
@ ประสิทธิภาพ (Time Complexity)
* 1. กรณีดีที่สุด (Best Case): O(nlog n) – เกิดขึ้นเมื่อ Pivot สามารถ "แบ่งข้อมูลออกเป็น 2 ฝั่งได้เท่าๆ กัน"
    (หรือใกล้เคียงกัน) เสมอ
    ● T(n) = 2T(n/2) + n
        - 2T(n/2) คือเราต้องแก้ปัญหาย่อย 2 ฝั่ง ซึ่งแต่ละฝั่งมีขนาดเหลือครึ่งเดียว 
        - n คือเวลาที่ใช้ในการ Partition (วนลูปเทียบข้อมูลทุกตัวกับ Pivot ในรอบนั้น)
* 2. กรณีทั่วไป (Average Case): O(nlog n) – เร็วมาก และใช้บ่อยที่สุด
* 3. กรณีแย่ที่สุด (Worst Case): O(n^2) – เกิดขึ้นเมื่อข้อมูลเรียงลำดับมาอยู่แล้ว แล้วเราเลือกตัวสุดท้ายเป็น 
     Pivot เสมอ (แต่แก้ไขได้โดยการสุ่มเลือก Pivot)
    ● T(n) = T(n - 1) + n
        - T(n - 1) ปัญหาลดขนาดลงไปแค่ 1 ตัว (เหมือนปอกเปลือกหัวหอมทีละชั้น)
        - n เวลาที่ใช้ Partition
@ ตัวอย่างการทำงาน (Pivot ที่ตำแหน่งสุดท้าย)
- สมมติมีตัวเลข: [10, 80, 30, 90, 40] เราเลือกตัวสุดท้าย 40 เป็น Pivot
    * รอบที่ 1: pivot = 40, low = 0, high = 4 → [10, 80, 30, 90, 40]
        ● i เริ่มที่ -1, j เริ่มที่ 0 - 3
        ✅ ่j = 0; 10 < 40 → i = 0 swap(10, 10) → ได้ [10, 80, 30, 90, 40]
        ❌ ่j = 1; 80 > 40
        ✅ ่j = 2; 30 < 40 → i = 1 swap(80, 30) → ได้ [10, 30, 80, 90, 40]
        ❌ ่j = 3; 90 > 40
        ● จบลูป j >= high แล้ว
        ● สลับ pivot (40) กับ arr[i + 1(2)] (10) → ได้ [10, 30, 40, 90, 80]
        ● แบ่งเป็น 2 ฝั่ง: [10, 30] กับ [90, 80]
    * รอบที่ 2: pivot = 30, low = 0, high = 1 → [10, 30]
        ● i เริ่มที่ -1, j เริ่มที่ 0 - 0
        ✅ ่j = 0; 10 < 30 → i = 0 swap(10, 10) → ได้ [10, 30]
        ● จบลูป j >= high แล้ว
        ● สลับ pivot (30) กับ arr[i + 1(1)] (30) → ได้ [10, 30]
        ● แบ่งเป็น 2 ฝั่ง: [10] กับ []
    * รอบที่ 3: pivot = 80, low = 3, high = 4 → [90, 80]
        ❌ ่j = 3; 90 > 80
        ● จบลูป j >= high แล้ว
        ● สลับ pivot (80) กับ arr[i + 1(0)] (90) → ได้ [80, 90]
        ● แบ่งเป็น 2 ฝั่ง: [] กับ [90]
- สุดท้ายได้อาร์เรย์ที่เรียงลำดับแล้ว: [10, 30, 40, 80, 90]
*/