//* Activity Selection Problem

/*
? ปัญหาคืออะไร?
- มีหลายกิจกรรมแต่ละกิจกรรมมี (start, end) เลือกให้ได้ “จำนวนมากที่สุด” โดยที่ ไม่ทับกัน
* คำตอบที่ถูกต้องจริง ๆ คือ
- เลือกกิจกรรมที่ “จบเร็วที่สุด” ก่อน (Earliest End Time) อันนี้พิสูจน์แล้วว่า optimal 100%
? หลักการของ Greedy (Greedy Strategy)
@ 1. Longest First: เลือกกิจกรรมที่มีระยะเวลานานที่สุดก่อน
- กิจกรรมยาว ๆ จะบล็อกพื้นที่เยอะ ทำให้เราเสียโอกาสในการเลือกกิจกรรมอื่น ๆ ที่สามารถทำได้มากกว่า
* ตัวอย่าง: (1,10), (2,3), (4,5), (6,7), (8,9)
    - Longest first → เลือก (1,10) ได้แค่ 1
    - Optimal → เลือก (2,3), (4,5), (6,7), (8,9) ได้ถึง 4
@ 2. Smallest Interval First: เลือกกิจกรรมที่มีระยะเวลาสั้นที่สุดก่อน
- กิจกรรมสั้น ๆ อาจจะดูเหมือนคุ้มค่า แต่จริง ๆ แล้วมันอาจจะทำมห้เราเสียโอกาสในการเลือกกิจกรรมอื่น ๆ 
  ที่สามารถทำได้มากกว่า
* ตัวอย่าง: (0, 5), (4, 6), (5, 10)
    - Smallest interval first → เลือก (4,6) ได้แค่ 1
    - Optimal → เลือก (0,5) และ (5,10) ได้ถึง 2
@ 3. Least Conflict First: เลือกกิจกรรมที่ทับซ้อนกับกิจกรรมอื่น ๆ น้อยที่สุดก่อน
- การคำนวณ conflict ต้องดูทั้งระบบ และมันไม่รับประกัน optimal
- บางครั้งกิจกรรมที่ conflict น้อยกลับอยู่กลาง timeline ทำให้เสียโอกาสเลือกตัวอื่น
* ตัวอย่าง: 
- ชุดข้อมูลตัวอย่าง (6 ช่วงเวลา) เรามีช่วงเวลาดังนี้:
    ● กลุ่มบน: (0, 2), (2, 4) — 2 ช่วงที่ต่อกัน
    ● กลุ่มล่าง: (6, 8), (8, 10) — 2 ช่วงที่ต่อกัน
    ● ตัวเชื่อม: (1, 6), (4, 9) — 2 ช่วงที่ทับซ้อนเยอะ
- วิธี Least Conflict First (ไม่ Optimal) - มานับจำนวนการทับซ้อน (Conflicts) ของแต่ละช่วง:
    ● (0, 2): ทับ 1 งาน (ทับกับ 1, 6)
    ● (2, 4): ทับ 1 งาน (ทับกับ 1, 6)
    ● (6, 8): ทับ 1 งาน (ทับกับ 4, 9)
    ● (8, 10): ทับ 1 งาน (ทับกับ 4, 9)
    ● (1, 6): ทับ 3 งาน (ทับกับ 0, 2 และ 2, 4 และ 4, 9)
    ● (4, 9): ทับ 3 งาน (ทับกับ 1, 6 และ 6, 8 และ 8, 10)
    - ผลลัพธ์: Algorithm จะเลือกงานที่ทับน้อยที่สุด (Conflict = 1) ก่อน เช่น เลือก (1, 6) และ (4, 9) 
      (เพราะมี Conflict ต่ำสุดในช่วงเวลานั้นๆ) รวมได้แค่ 2 งาน แล้วงานที่เหลือจะถูก Block ทั้งหมด
- Optimal → เลือก (0, 2), (2, 4), (6, 8), (8, 10) ได้ถึง 4 งาน
@ 4. Earliest Start Time First: เลือกกิจกรรมที่เริ่มต้นเร็วที่สุดก่อน
- เหมาะกับปัญหา Interval Partitioning Problem โจทย์ไม่ได้ให้เรา "เลือกทิ้ง" งาน แต่บังคับว่า "ต้องทำ
  งานทุกงานให้เสร็จ" โดยใช้ทรัพยากร (เช่น ห้องประชุม หรือ เครื่องจักร) ให้ น้อยที่สุด
* ตัวอย่าง: (1,10), (2,3), (4,5), (6,7)
    - Earliest start time first → เลือก (1,10) ได้แค่ 1
    - Optimal → เลือก (2,3), (4,5), (6,7) ได้ถึง 3
@ 5. Earliest End Time First: เลือกกิจกรรมที่จบเร็วที่สุดก่อน (Optimal)
- วิธีนี้พิสูจน์แล้วว่าให้คำตอบที่ดีที่สุดเสมอ (Optimal) เพราะมันเปิดพื้นที่ให้เราเลือกกิจกรรมอื่น ๆ ได้มากที่สุด
* ตัวอย่าง: (1,10), (2,3), (4,5), (6,7)
    - Earliest end time first → เลือก (2,3) → (4,5) → (6,7) ได้ถึง 3
    - Optimal → เลือก (2,3), (4,5), (6,7) ได้ถึง 3
*/