//* Interval Partitioning Problem

/*
? ปัญหาคืออะไร?
- มีหลายกิจกรรมแต่ละกิจกรรมมี (start, end) โจทย์ไม่ได้ให้เรา "เลือกทิ้ง" งาน แต่บังคับว่า "ต้องทำ
  งานทุกงานให้เสร็จ" โดยใช้ทรัพยากร (เช่น ห้องประชุม หรือ เครื่องจักร) ให้ น้อยที่สุด
- ถ้าไม่มี resource ไหนว่าง → เปิด resource ใหม่
* คำตอบที่ถูกต้องจริง ๆ คือ
- เลือกกิจกรรมที่ “เริ่มต้นเร็วที่สุด” ก่อน (Earliest Start Time) อันนี้พิสูจน์แล้วว่า optimal 100%
? หลักการของ Greedy (Greedy Strategy)
@ 1. Longest First: เลือกกิจกรรมที่มีระยะเวลานานที่สุดก่อน
- กิจกรรมยาว ๆ จะไปบล็อก resource นานเกินจำเป็น
* ตัวอย่าง: (1, 4), (3, 5), (5, 7), (1, 7)
    - เรียงตามระยะเวลานานที่สุด: (1, 7), (1, 4), (3, 5), (5, 7)
    - Longest first → ใช้ resource = 3
@ 2. Smallest Interval First: เลือกกิจกรรมที่มีระยะเวลาสั้นที่สุดก่อน
- กิจกรรมสั้น ๆ อาจจะดูเหมือนคุ้มค่า แต่จริง ๆ แล้วมันอาจจะทำมห้เราเสียโอกาสในการเลือกกิจกรรมอื่น ๆ 
  ที่สามารถทำได้มากกว่า
* ตัวอย่าง: (1, 4), (3, 5), (5, 7), (1, 7)
    - เรียงตามระยะเวลาสั้นที่สุด: (3, 5), (5, 7), (1, 4), (1, 7)
    - Smallest interval first → ใช้ resource = 3
@ 3. Least Conflict First: เลือกกิจกรรมที่ทับซ้อนกับกิจกรรมอื่น ๆ น้อยที่สุดก่อน
- การคำนวณ conflict ต้องดูทั้งระบบ และมันไม่รับประกัน optimal
- บางครั้งกิจกรรมที่ conflict น้อยกลับอยู่กลาง timeline ทำให้เสียโอกาสเลือกตัวอื่น
@ 4. Earliest Start Time First: เลือกกิจกรรมที่เริ่มต้นเร็วที่สุดก่อน (Optimal)
- เรียงกิจกรรมตามเวลาเริ่มต้นจากน้อยไปมาก
- เหมาะกับปัญหา Interval Partitioning Problem
* ตัวอย่าง: (1,10), (2,3), (4,5), (6,7)
    - เรียงตามระยะเวลาเริ่มต้น: (1,10), (2,3), (4,5), (6,7)
    - Earliest start time first → ใช้ resource = 2
@ 5. Earliest End Time First: เลือกกิจกรรมที่จบเร็วที่สุดก่อน
- เหมาะกับปัญหา Activity Selection Problem มันเปิดพื้นที่ให้เราเลือกกิจกรรมอื่น ๆ ได้มากที่สุด
* ตัวอย่าง: (1,10), (2,3), (4,5), (6,7)
    - เรียงตามระยะเวลาเริ่มต้น: (2,3), (4,5), (6,7), (1,10)
    - Earliest end time first → ใช้ resource = 2
*/